let handler = async (m, { conn, text }) => {
  await m.react('💡⃝⚡')
  
  let advice = pickRandom(global.piropo)
  let caption = `* ִᗀᩙᰰ ̼𝆬🌙̸〫 ᮭ࣪࣪ ⸼۫  𝗠𝗔𝗦𝗛 𝗕𝗢𝗧 𝅄 ۫ ִᗀᩙᰰ ̼𝆬🌙*\n\n`
  caption += `*╭━ 💡 نـصـيـحـة الـيـوم ━━⃝⚡*\n`
  caption += `*│* \n`
  caption += `*│* ⚡ *${advice}*\n`
  caption += `*│* \n`
  caption += `*╰━━━━━━━━━━━━━⃝🌙*`

  conn.reply(m.chat, caption, m)
}

handler.tags = ['frases ⃝🌙']
handler.command = ['نصايح', 'نصيحة']

export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.piropo = [
  "استمتع بمذاق الحياة في كل لحظة",
  "سامح اعدائك ولكن اياك ان تنسي اسمهم",
  "لا تتحج بنقص الوقت فيومك هو نفس يوم العلماء الذين حققوا انجازات عظيمه",
  "لا تنتقد اطفالك امام الاخرين مهما حدث",
  "لا تدع العقول الصغيرة تقنعك بأن أحلامك أكبر من اللازم",
  "لا تتحسر علي الماضي",
  "كن متسامح",
  "كن طيبا",
  "لا تطلب خدمة من شخص الم تساعده 3 مرات علي الاقل",
  "الحياة كالمرآة، تحصل على أفضل النتائج حين تبتسم لها",
  "لا تعد نعمك بل استخدمها لتسعد الاخرين", 
  "كرهك لشخص ما لايعني انه علي خطأ", 
  "كن اكثر لطفا وحكمة يوما بعد يوم", 
  "اتقي الله في كل شيء", 
  "لا تضيع طاقتك في الرد على الانتقادات", 
  "اهتم بجسمك وصحتك العقلية", 
  "كن مراقب نفسك، مشجع نفسك، مُلزم نفسك، مكافئ نفسك، مقيم نفسك، لا تنتظر شئ من أحد", 
  "النجاح هو المواظبة ولو بالقليل، فالقليل دائم خير من كثير منقطع", 
  "اهتم بجودة ماتعمل", 
  "عود نفسك على العمل تحت أي ظرف بغض النظر عن حالتك المزاجية", 
  "قل الحق ولو كان مرا ولو كان علي نفسك", 
  "فما دُمتَ تحاول فأنت ناجح والفشلُ هو التوقُّف عن تلك المحاولة",
  "لا تسمع عني، بل اسمع مني أولًا", 
  "حالتك المزاجية لا علاقة لها بما يجب أن تقوم به", 
  "إقرأ القرآن على قدر ما تتمنى من السعادة", 
  "التعب في نيل الشئ جزء من متعة هذا الشىء", 
  "عندما يختفي الاحترام في أي علاقة عليك بالرحيل", 
  "إياك ولصوص الوقت", 
  "كن لطيفًا مع الجميع، إن الوداع قريب قد يأتي في أي لحظة", 
  "عد الى الله ولو اذنبت الف مرة", 
  "قلل من وقتك على مواقع التواصل", 
  "ألزم نفسك بالامتنان", 
  "الشخص الوحيد الذي يمكنك مقارنة نفسك به هو أنت في الماضي", 
  "قل شكراً كل يوم", 
  "اعتنِ بجسمك، تأكد من أن تنال قسطاً من الراحة", 
  "توقف عن قول “آسف” إلا إذا أخطأت", 
  "أعطِ الناس أكثر مما يتوقعون", 
  "اختر دائماً نفسك"
]
